# set() - множества
# Это изменяемый, неупорядоченный, итерируемый, неиндексируемый тип данных
# множества хранят в себе только неизменяемые типы данных
# 1 способ создания set -- set()
# a = set([1,2,3,4])
# print(a)

# a = set({1:2, 3:4})  # Сохраняет только ключи
# print(a)

# 2) способ создания set():   {}
# set2 = {1,2,4}
# print(set2)
# set1 = {1,1,1,2,2,2,4,5}
# print(set1)
# set1 = {}
# print(type(set1))  # type: dict   Если скобки пустые, но если внести значения, то будет класс set
# set1 = {4, 2, True, False}    #Вывод: {0,1} ставит по порядку
# print(set1)
#------------------------------------------------------------------------------------------
#Методы set():
# add - для добавления значения в конец, принимает только одно значение
# set1 = {1,2,3}
# set1.add((4,5,6,7)) #{1, 2, 3, (4, 5, 6, 7)}
# print(set1)
#--------------------------------------------------------------------------------------------
# Метод .update() - может добавлять несколько значений сразу но не повторяет имеющиеся значения
# Добавляет все итерируемые
# set1 = {1,2,3}
# set1.update({4,4,4,4,44,5,6,7}) #{1, 2, 3, 4, 5, 6, 7, 44}
# set1.update({3:'jnwef', 4:'lrwnm31'})  #{1, 2, 3, 4}
# print(set1)
# set1.update('string', {1,2,3,4,5,6,6,7}) #{1, 2, 3, 4, 'n', 5, 6, 7, 's', 'g', 't', 'r', 'i'}
# print(set1)
# set1.update('strpkjg')#{'p', 1, 2, 3, 'j', 'g', 'r', 'k', 's', 't'}
# print(set1)
# set1.update([1,2,3,4,5, 'string']) #{1, 2, 3, 4, 5, 'string'}
# print(set1)
#-------------------------------------------------------------------------------
# Удаление в set()
# 1) clear() - очищает все множества
# 2)remove() - принимает определенный элемент, если этого элемента нет, выдает ошибку
# 3) discard() - то же самое, но если указанного элемента нет, то ничего не происходит
# 4)pop() - Удаляет из set(first in, first out)
# set1 = {1,2,3,4,5}
# set1.remove(2,1) # можно указать только один элемент
# print(set1)
#----------------------------------------------------------------------
# set1 = {1,2,3,4,5}
# set1.clear()  #Удаляет все
# print(set1)
#------------------------------------------------------------------
# set1 = {1,2,3,4,5}
# set1.discard(2) # можно указать только один элемент
# print(set1)
#---------------------------------------------------------------------------
# set1 = {1,2,3,4,5}
# set1.pop() # можно указать только один элемент
# print(set1)
#------------------------------------------------------------------------
#                       Метод difference - выводит отличие
# set1 = {1,2,3,4}               
# set2 = {2,3,5,7}
# # print(set1.difference(set2))#{1, 4}
# print(set1 - set2)  #{1, 4}
# print(set2.difference(set1))
# print(set1.symmetric_difference(set2))    #{1, 4, 5, 7}
# print(set1^set2)   #{1, 4, 5, 7}
#------------------------------------------------------------------------
#Метод intersection()  - соединяет первый сет со вторым
# # print(set1.intersection(set2))#{2, 3}
# print(set1 & set2)#{2, 3}
# print(set1.union(set2)) #соединяет первый сет со вторым
# print(set1 | set2) #{1, 2, 3, 4, 5, 7}
#--------------------------------------------------------------------------
#нужно проверить все ли числа в последовательности уникальны
# num = list(input())
# print(len(num) == len(set(num)))
#-------------------------------------------------------------------------
# frozenset() - неизменяемое множество 
# a = frozenset([1,2,3,4,5])
# a.add(7) #'frozenset' object has no attribute 'add'
# print(a)
#--------------------------------------------------------------------------б
#tuple - неизменяемый, индексируемый, итерируемый, упорядоченный тип данных
# есть только 2 метода:
# 1) index(element) -- возврашает индекс указанного элемента в кортеж
# литераты tuple это круглые скобки -- ()
# a = (1,2, True, 'hahk', 48,1,1,1,1,1,1,1,1,1,1,1)
# print(a, type(a))
# b = tuple()
# # 2) count(element) -- возвращает число вхождений этого элемента в кортеж
# print(a.count(1))  #13   True - считается за единицу
# labels = ['rollsroyce', 'honda', 'gmc']
# for i in labels:
#     if i == 'rollsroyce':
#         print(f'i like brand {i}')
#     elif i == 'honda':
#         print(f'i like brand {i}')
#     else:
#         print(f'i like brand {i}')




n = int(input())
if 5 <= n <= 20:
    word = 'коров'
elif n % 10 == 1:
    word = 'корова'
elif n % 10 == 2 or n % 10 == 3 or n % 10 == 4:
    word = 'коровы'
else:
    word = 'коров'
print(f'На лугу пасется {n} {word}')
