x = 21; x //= 5
print(x)
x = 3 + 5 * 6 - 33
print(x)

#Оператор Описание

#lambda лямбда-выражение

#or Логическое «ИЛИ»

#and Логическое «И»

#not x Логическое «НЕ»

#in, not in Проверка принадлежности

#is, is not Проверка тождественности

#<, <=, >, >=, !=, == Сравнения

#| Побитовое «ИЛИ»

#^ Побитовое «ИСКЛЮЧИТЕЛЬНО ИЛИ»

#& Побитовое «И»

#<<, >> Сдвиги

#+, - Сложение и вычитание

#*, /, //, % Умножение, деление, целочисленное деление и остаток от деления

#+x, -x Положительное, отрицательное

#~x Побитовое НЕ

##** Возведение в степень

#x.attribute Ссылка на атрибут

#x[индекс] Обращение по индексу

#x[индекс1:индекс2] Вырезка

#f(аргументы ...) Вызов функции

#(выражения, ...) Связка или кортеж2

#[выражения, ...] Список

#{ключ:данные,
#...}
#Словарь